{
  "architectures": [
    "BertForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "directionality": "bidi",
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "B-CONTACT_INFO",
    "1": "B-LOC",
    "2": "B-PRICE",
    "3": "B-Product",
    "4": "B-QUANTITY",
    "5": "B-SPECIFICATION",
    "6": "I-CONTACT_INFO",
    "7": "I-LOC",
    "8": "I-PRICE",
    "9": "I-Product",
    "10": "O"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "B-CONTACT_INFO": 0,
    "B-LOC": 1,
    "B-PRICE": 2,
    "B-Product": 3,
    "B-QUANTITY": 4,
    "B-SPECIFICATION": 5,
    "I-CONTACT_INFO": 6,
    "I-LOC": 7,
    "I-PRICE": 8,
    "I-Product": 9,
    "O": 10
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "pooler_fc_size": 768,
  "pooler_num_attention_heads": 12,
  "pooler_num_fc_layers": 3,
  "pooler_size_per_head": 128,
  "pooler_type": "first_token_transform",
  "position_embedding_type": "absolute",
  "torch_dtype": "float32",
  "transformers_version": "4.53.3",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 119547
}
